src/cf/AccumulationRegisters/swПартииТоваровОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>swПартииТоваровОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументПартииПриВозврате</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>swПартия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.swПартииТоваровОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/swПартииТоваровОрганизаций/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если Не Отказ Тогда
		Регистратор = Отбор.Регистратор.Значение;
		Если Количество() = 0 Тогда
			Запрос = Новый Запрос;
			Текст = "ВЫБРАТЬ
			        |	Данные.НомерСтроки
			        |ИЗ
			        |	РегистрНакопления.swПартииТоваровОрганизаций КАК Данные
			        |ГДЕ
			        |	Данные.Регистратор = &Регистратор";
			Запрос.Текст = Текст;
			Запрос.УстановитьПараметр("Регистратор", Регистратор);
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда
				ДополнительныеСвойства.Вставить("РанееНеБылоДвижений", Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если Не Отказ Тогда
		Регистратор = Отбор.Регистратор.Значение;
		Дата = Регистратор.Дата;
		Если Не ЗначениеЗаполнено(Дата) И Количество() > 0 Тогда
			Дата = ЭтотОбъект[0].Период;
		КонецЕсли;
		Организация = Неопределено;
		Если Не ТипЗнч(Регистратор) = Тип("ДокументСсылка.КорректировкаРегистров") Тогда
			Организация = Регистратор.Организация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Организация) И Количество() > 0 Тогда
			Организация = ЭтотОбъект[0].Организация;
		КонецЕсли;
		ОчиститьРегистрацию = (Количество() = 0);
		НужноДвигатьПоследовательность = Истина;
		Если Не (ОчиститьРегистрацию И ДополнительныеСвойства.Свойство("РанееНеБылоДвижений")) Тогда
			swДвиженияТоваровОрганизаций.ЗарегистрироватьДвиженияВПоследовательности(Регистратор, Дата, Организация, ОчиститьРегистрацию);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
